i=int(0)
while i == 0 :
    a = int(input("اگه میخوای یه ب.م.م بهت بدم ؛ عدد کوفتی اولت رو وارد کن؛ اگر هم میخوای خارج شی ، برای عدد اول بنویس 0 "))
    if a == 0 :
        print("اصلا از همون اول هم لیاقت من رو نداشتی که بخوام برات ب.م.م حساب کنم؛ ایششششش ؛ برو گمشو")
        i = 1
        break
    b = int(input("خیلی خب، حالا عدد کوفتی دومت هم که میخوای ب.م.م اش رو به دست بیارم وارد کن"))
    while 0==0 :
        c = a % b
        if c == 0:
            print(b , "همون ب.م.م کزایی ایه که دنبالش میگشتی ، حالا یا یه عدد دیگه رد کن بیاد ، یا شرت رو کم کن")
            break
        else:
            a, b = b, c